Λ_term[0] = ς / τb**2

ϑ_term[0] = τ0(s) / τb

P_term[0] = 1

Q_term[0] = 1

Λ_term[1] = (
    -ς
    * (
        η[0](s) ** 7 * κ(s)
        - η[0](s) ** 5 * κ(s)
        + sy.I * η[0](s) ** 5 * sy.Derivative(η[0](s), s)
        - η[0](s) ** 3 * κ(s)
        + η[0](s) ** 2 * η[1](s)
        + η[0](s) * κ(s)
        + 3 * sy.I * η[0](s) * sy.Derivative(η[0](s), s)
        + η[1](s)
    )
    / (τb**2 * (η[0](s) - 1) * (η[0](s) + 1) * (η[0](s) ** 2 + 1) * η[0](s) ** 2)
)

ϑ_term[1] = (
    Λ_[1] * ς * τb * η[0](s) ** 6 * τ0(s)
    - Λ_[1] * ς * τb * η[0](s) ** 2 * τ0(s)
    + η[0](s) ** 7 * κ(s)
    - η[0](s) ** 5 * κ(s)
    + sy.I * η[0](s) ** 5 * sy.Derivative(η[0](s), s)
    - η[0](s) ** 3 * κ(s)
    + η[0](s) ** 2 * η[1](s)
    + η[0](s) * κ(s)
    + 3 * sy.I * η[0](s) * sy.Derivative(η[0](s), s)
    + η[1](s)
) / (2 * (η[0](s) - 1) * (η[0](s) + 1) * (η[0](s) ** 2 + 1) * η[0](s) ** 2)

P_term[1] = (
    -σ
    * (
        -Λ_[1] * ς * τb**2 * η[0](s) ** 5 * τ0(s) ** 2
        + Λ_[1] * ς * τb**2 * η[0](s) * τ0(s) ** 2
        - Λ_[1] * τb**2 * η[0](s) ** 7
        + Λ_[1] * τb**2 * η[0](s) ** 3
        - σ * η[0](s) ** 6 * η[1](s) * τ0(s) ** 2
        + sy.I * σ * η[0](s) ** 6 * τ0(s) * sy.Derivative(τ0(s), s)
        + σ * η[0](s) ** 5 * κ(s) * τ0(s) ** 2
        + sy.I * σ * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + σ * η[0](s) ** 4 * η[1](s) * τ0(s) ** 2
        + σ * η[0](s) ** 2 * η[1](s) * τ0(s) ** 2
        - sy.I * σ * η[0](s) ** 2 * τ0(s) * sy.Derivative(τ0(s), s)
        - σ * η[0](s) * κ(s) * τ0(s) ** 2
        - sy.I * σ * η[0](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - σ * η[1](s) * τ0(s) ** 2
        - τb * η[0](s) ** 5 * η[1](s) * τ0(s)
        - 4 * sy.I * τb * η[0](s) ** 4 * τ0(s) * sy.Derivative(η[0](s), s)
        - τb * η[0](s) ** 3 * η[1](s) * τ0(s)
    )
    / (
        2
        * τb
        * (η[0](s) - 1)
        * (η[0](s) + 1)
        * (η[0](s) ** 2 + 1)
        * η[0](s) ** 2
        * τ0(s)
    )
)

Q_term[1] = (
    σ
    * (
        -Λ_[1] * ς * τb**2 * η[0](s) ** 6 * τ0(s) ** 2
        + Λ_[1] * ς * τb**2 * η[0](s) ** 2 * τ0(s) ** 2
        + Λ_[1] * τb**2 * η[0](s) ** 6
        - Λ_[1] * τb**2 * η[0](s) ** 2
        + σ * η[0](s) ** 6 * κ(s) * τ0(s) ** 2
        - sy.I * σ * η[0](s) ** 5 * τ0(s) * sy.Derivative(τ0(s), s)
        + sy.I * σ * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - σ * η[0](s) ** 2 * κ(s) * τ0(s) ** 2
        + sy.I * σ * η[0](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - sy.I * σ * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - τb * η[0](s) ** 2 * η[1](s) * τ0(s)
        - 4 * sy.I * τb * η[0](s) * τ0(s) * sy.Derivative(η[0](s), s)
        - τb * η[1](s) * τ0(s)
    )
    / (2 * τb * (η[0](s) - 1) * (η[0](s) + 1) * (η[0](s) ** 2 + 1) * η[0](s) * τ0(s))
)

Λ_term[2] = (
    ς
    * (
        -(Λ_[1] ** 2) * ς**2 * τb**2 * η[0](s) ** 16 * τ0(s) ** 4
        + Λ_[1] ** 2 * ς**2 * τb**2 * η[0](s) ** 14 * τ0(s) ** 4
        + Λ_[1] ** 2 * ς**2 * τb**2 * η[0](s) ** 12 * τ0(s) ** 4
        - 2 * Λ_[1] ** 2 * ς**2 * τb**2 * η[0](s) ** 10 * τ0(s) ** 4
        + Λ_[1] ** 2 * ς**2 * τb**2 * η[0](s) ** 8 * τ0(s) ** 4
        + Λ_[1] ** 2 * ς**2 * τb**2 * η[0](s) ** 6 * τ0(s) ** 4
        - Λ_[1] ** 2 * ς**2 * τb**2 * η[0](s) ** 4 * τ0(s) ** 4
        + 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 16 * τ0(s) ** 2
        - 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 12 * τ0(s) ** 2
        + 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 10 * τ0(s) ** 2
        - 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 6 * τ0(s) ** 2
        - Λ_[1] ** 2 * τb**2 * η[0](s) ** 16
        + 2 * Λ_[1] ** 2 * τb**2 * η[0](s) ** 12
        - Λ_[1] ** 2 * τb**2 * η[0](s) ** 8
        + 2 * Λ_[1] * ς * τb * η[0](s) ** 17 * κ(s) * τ0(s) ** 3
        + 4
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 15
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 4 * Λ_[1] * ς * τb * η[0](s) ** 13 * κ(s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 12 * η[1](s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 11 * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 11
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * ς * τb * η[0](s) ** 9 * κ(s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 8 * η[1](s) * τ0(s) ** 3
        + 4 * Λ_[1] * ς * τb * η[0](s) ** 7 * κ(s) * τ0(s) ** 3
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 7
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * ς * τb * η[0](s) ** 6 * η[1](s) * τ0(s) ** 3
        + 4 * Λ_[1] * ς * τb * η[0](s) ** 4 * η[1](s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 3 * κ(s) * τ0(s) ** 3
        - 4
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 3
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 2 * η[1](s) * τ0(s) ** 3
        - 2 * Λ_[1] * τb * η[0](s) ** 17 * κ(s) * τ0(s)
        + 4 * sy.I * Λ_[1] * τb * η[0](s) ** 16 * sy.Derivative(τ0(s), s)
        - 2 * Λ_[1] * τb * η[0](s) ** 15 * κ(s) * τ0(s)
        - 4 * sy.I * Λ_[1] * τb * η[0](s) ** 15 * τ0(s) * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * τb * η[0](s) ** 13 * κ(s) * τ0(s)
        + 2 * Λ_[1] * τb * η[0](s) ** 12 * η[1](s) * τ0(s)
        - 4 * sy.I * Λ_[1] * τb * η[0](s) ** 12 * sy.Derivative(τ0(s), s)
        + 4 * Λ_[1] * τb * η[0](s) ** 11 * κ(s) * τ0(s)
        + 12 * sy.I * Λ_[1] * τb * η[0](s) ** 11 * τ0(s) * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * τb * η[0](s) ** 10 * η[1](s) * τ0(s)
        + 4 * sy.I * Λ_[1] * τb * η[0](s) ** 10 * sy.Derivative(τ0(s), s)
        + 2 * Λ_[1] * τb * η[0](s) ** 9 * κ(s) * τ0(s)
        + 8 * sy.I * Λ_[1] * τb * η[0](s) ** 9 * τ0(s) * sy.Derivative(η[0](s), s)
        + 4 * Λ_[1] * τb * η[0](s) ** 8 * η[1](s) * τ0(s)
        - 2 * Λ_[1] * τb * η[0](s) ** 7 * κ(s) * τ0(s)
        + 2 * Λ_[1] * τb * η[0](s) ** 6 * η[1](s) * τ0(s)
        - 4 * sy.I * Λ_[1] * τb * η[0](s) ** 6 * sy.Derivative(τ0(s), s)
        - 2 * Λ_[1] * τb * η[0](s) ** 5 * κ(s) * τ0(s)
        - 2 * Λ_[1] * τb * η[0](s) ** 4 * η[1](s) * τ0(s)
        - 2 * η[0](s) ** 18 * κ(s) ** 2 * τ0(s) ** 2
        + 2 * sy.I * η[0](s) ** 17 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 2 * sy.I * η[0](s) ** 17 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + η[0](s) ** 16 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * η[0](s) ** 16 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[0](s) ** 16 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 2 * η[0](s) ** 16 * sy.Derivative(τ0(s), s) ** 2
        + 2 * η[0](s) ** 15 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 2
        * η[0](s) ** 15
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 2 * η[0](s) ** 14 * κ(s) ** 2 * τ0(s) ** 2
        + 2 * η[0](s) ** 14 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 14 * sy.Derivative(τ0(s), s) ** 2
        + 2 * η[0](s) ** 13 * η[1](s) * κ(s) * τ0(s) ** 2
        - 4 * sy.I * η[0](s) ** 13 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 4 * sy.I * η[0](s) ** 13 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 2
        * η[0](s) ** 13
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 2 * sy.I * η[0](s) ** 12 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - η[0](s) ** 12 * κ(s) ** 2 * τ0(s) ** 2
        + 12 * sy.I * η[0](s) ** 12 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 2 * sy.I * η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 2 * η[0](s) ** 12 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 12 * sy.Derivative(τ0(s), s) ** 2
        + 2 * η[0](s) ** 11 * η[1](s) * κ(s) * τ0(s) ** 2
        - 4 * sy.I * η[0](s) ** 11 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * sy.I * η[0](s) ** 11 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 10 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 2 * sy.I * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 10
        * η[0](s) ** 11
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6 * sy.I * η[0](s) ** 10 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 24 * η[0](s) ** 10 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 4 * η[0](s) ** 10 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 4 * η[0](s) ** 10 * sy.Derivative(τ0(s), s) ** 2
        - 2 * η[0](s) ** 9 * η[1](s) * κ(s) * τ0(s) ** 2
        + 2 * η[0](s) ** 9 * η[2](s) * τ0(s) ** 2
        + 2 * sy.I * η[0](s) ** 9 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 4 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 2 * sy.I * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 6 * η[0](s) ** 8 * η[1](s) ** 2 * τ0(s) ** 2
        - 2 * sy.I * η[0](s) ** 8 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - η[0](s) ** 8 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * η[0](s) ** 8 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 26 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 2 * sy.I * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 2 * η[0](s) ** 8 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 8 * sy.Derivative(τ0(s), s) ** 2
        - 6 * η[0](s) ** 7 * η[1](s) * κ(s) * τ0(s) ** 2
        - 28 * sy.I * η[0](s) ** 7 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 2 * η[0](s) ** 7 * η[2](s) * τ0(s) ** 2
        + 4 * sy.I * η[0](s) ** 7 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 10 * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 4 * sy.I * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 10
        * η[0](s) ** 7
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 9 * η[0](s) ** 6 * η[1](s) ** 2 * τ0(s) ** 2
        + 2 * sy.I * η[0](s) ** 6 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 2 * η[0](s) ** 6 * κ(s) ** 2 * τ0(s) ** 2
        + 12 * sy.I * η[0](s) ** 6 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 4 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 2 * sy.I * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 2 * η[0](s) ** 6 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 6 * sy.Derivative(τ0(s), s) ** 2
        + 4 * η[0](s) ** 5 * η[1](s) * κ(s) * τ0(s) ** 2
        + 16 * sy.I * η[0](s) ** 5 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[0](s) ** 5 * η[2](s) * τ0(s) ** 2
        - 4 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 2 * η[0](s) ** 5 * τ0(s) * sy.Derivative(η[0](s), s) * sy.Derivative(τ0(s), s)
        + 6 * η[0](s) ** 4 * η[1](s) ** 2 * τ0(s) ** 2
        + 4 * sy.I * η[0](s) ** 4 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + η[0](s) ** 4 * κ(s) ** 2 * τ0(s) ** 2
        + 9 * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 4 * sy.I * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 2 * η[0](s) ** 4 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 2 * η[0](s) ** 4 * sy.Derivative(τ0(s), s) ** 2
        + 4 * η[0](s) ** 3 * η[1](s) * κ(s) * τ0(s) ** 2
        + 8 * sy.I * η[0](s) ** 3 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[0](s) ** 3 * η[2](s) * τ0(s) ** 2
        - 2 * sy.I * η[0](s) ** 3 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 2 * η[0](s) ** 3 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 2 * sy.I * η[0](s) ** 3 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 2 * η[0](s) ** 3 * τ0(s) * sy.Derivative(η[0](s), s) * sy.Derivative(τ0(s), s)
        + 7 * η[0](s) ** 2 * η[1](s) ** 2 * τ0(s) ** 2
        - 2 * sy.I * η[0](s) ** 2 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 2 * η[0](s) ** 2 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * η[0](s) ** 2 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 4 * η[0](s) ** 2 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 2 * sy.I * η[0](s) ** 2 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 4 * η[0](s) * η[1](s) * κ(s) * τ0(s) ** 2
        - 8 * sy.I * η[0](s) * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[1](s) ** 2 * τ0(s) ** 2
    )
    / (
        4
        * τb
        * (η[0](s) - 1) ** 2
        * (η[0](s) + 1) ** 2
        * (η[0](s) ** 2 + 1) ** 2
        * η[0](s) ** 6
        * τ0(s) ** 3
    )
)

ϑ_term[2] = (
    -τb
    * (
        2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 16 * τ0(s) ** 2
        - 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 12 * τ0(s) ** 2
        + 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 10 * τ0(s) ** 2
        - 2 * Λ_[1] ** 2 * ς * τb**2 * η[0](s) ** 6 * τ0(s) ** 2
        - Λ_[1] ** 2 * τb**2 * η[0](s) ** 16 * τ0(s) ** 4
        - Λ_[1] ** 2 * τb**2 * η[0](s) ** 16
        + Λ_[1] ** 2 * τb**2 * η[0](s) ** 14 * τ0(s) ** 4
        + Λ_[1] ** 2 * τb**2 * η[0](s) ** 12 * τ0(s) ** 4
        + 2 * Λ_[1] ** 2 * τb**2 * η[0](s) ** 12
        - 2 * Λ_[1] ** 2 * τb**2 * η[0](s) ** 10 * τ0(s) ** 4
        + Λ_[1] ** 2 * τb**2 * η[0](s) ** 8 * τ0(s) ** 4
        - Λ_[1] ** 2 * τb**2 * η[0](s) ** 8
        + Λ_[1] ** 2 * τb**2 * η[0](s) ** 6 * τ0(s) ** 4
        - Λ_[1] ** 2 * τb**2 * η[0](s) ** 4 * τ0(s) ** 4
        + 2 * Λ_[1] * ς * τb * η[0](s) ** 17 * κ(s) * τ0(s) ** 3
        + 4
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 15
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 4 * Λ_[1] * ς * τb * η[0](s) ** 13 * κ(s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 12 * η[1](s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 11 * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 11
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * ς * τb * η[0](s) ** 9 * κ(s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 8 * η[1](s) * τ0(s) ** 3
        + 4 * Λ_[1] * ς * τb * η[0](s) ** 7 * κ(s) * τ0(s) ** 3
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 7
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * ς * τb * η[0](s) ** 6 * η[1](s) * τ0(s) ** 3
        + 4 * Λ_[1] * ς * τb * η[0](s) ** 4 * η[1](s) * τ0(s) ** 3
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 3 * κ(s) * τ0(s) ** 3
        - 4
        * sy.I
        * Λ_[1]
        * ς
        * τb
        * η[0](s) ** 3
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 2 * Λ_[1] * ς * τb * η[0](s) ** 2 * η[1](s) * τ0(s) ** 3
        - 2 * Λ_[1] * τb * η[0](s) ** 17 * κ(s) * τ0(s)
        + 4 * sy.I * Λ_[1] * τb * η[0](s) ** 16 * sy.Derivative(τ0(s), s)
        - 2 * Λ_[1] * τb * η[0](s) ** 15 * κ(s) * τ0(s)
        - 4 * sy.I * Λ_[1] * τb * η[0](s) ** 15 * τ0(s) * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * τb * η[0](s) ** 13 * κ(s) * τ0(s)
        + 2 * Λ_[1] * τb * η[0](s) ** 12 * η[1](s) * τ0(s)
        - 4 * sy.I * Λ_[1] * τb * η[0](s) ** 12 * sy.Derivative(τ0(s), s)
        + 4 * Λ_[1] * τb * η[0](s) ** 11 * κ(s) * τ0(s)
        + 12 * sy.I * Λ_[1] * τb * η[0](s) ** 11 * τ0(s) * sy.Derivative(η[0](s), s)
        + 2 * Λ_[1] * τb * η[0](s) ** 10 * η[1](s) * τ0(s)
        + 4 * sy.I * Λ_[1] * τb * η[0](s) ** 10 * sy.Derivative(τ0(s), s)
        + 2 * Λ_[1] * τb * η[0](s) ** 9 * κ(s) * τ0(s)
        + 8 * sy.I * Λ_[1] * τb * η[0](s) ** 9 * τ0(s) * sy.Derivative(η[0](s), s)
        + 4 * Λ_[1] * τb * η[0](s) ** 8 * η[1](s) * τ0(s)
        - 2 * Λ_[1] * τb * η[0](s) ** 7 * κ(s) * τ0(s)
        + 2 * Λ_[1] * τb * η[0](s) ** 6 * η[1](s) * τ0(s)
        - 4 * sy.I * Λ_[1] * τb * η[0](s) ** 6 * sy.Derivative(τ0(s), s)
        - 2 * Λ_[1] * τb * η[0](s) ** 5 * κ(s) * τ0(s)
        - 2 * Λ_[1] * τb * η[0](s) ** 4 * η[1](s) * τ0(s)
        - 4 * Λ_[2] * ς * η[0](s) ** 14 * τ0(s) ** 4
        + 8 * Λ_[2] * ς * η[0](s) ** 10 * τ0(s) ** 4
        - 4 * Λ_[2] * ς * η[0](s) ** 6 * τ0(s) ** 4
        - 2 * η[0](s) ** 18 * κ(s) ** 2 * τ0(s) ** 2
        + 2 * sy.I * η[0](s) ** 17 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 2 * sy.I * η[0](s) ** 17 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + η[0](s) ** 16 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * η[0](s) ** 16 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[0](s) ** 16 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 2 * η[0](s) ** 16 * sy.Derivative(τ0(s), s) ** 2
        + 2 * η[0](s) ** 15 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 2
        * η[0](s) ** 15
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 2 * η[0](s) ** 14 * κ(s) ** 2 * τ0(s) ** 2
        + 2 * η[0](s) ** 14 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 14 * sy.Derivative(τ0(s), s) ** 2
        + 2 * η[0](s) ** 13 * η[1](s) * κ(s) * τ0(s) ** 2
        - 4 * sy.I * η[0](s) ** 13 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 4 * sy.I * η[0](s) ** 13 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 2
        * η[0](s) ** 13
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 2 * sy.I * η[0](s) ** 12 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - η[0](s) ** 12 * κ(s) ** 2 * τ0(s) ** 2
        + 12 * sy.I * η[0](s) ** 12 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 2 * sy.I * η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 2 * η[0](s) ** 12 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 12 * sy.Derivative(τ0(s), s) ** 2
        + 2 * η[0](s) ** 11 * η[1](s) * κ(s) * τ0(s) ** 2
        - 4 * sy.I * η[0](s) ** 11 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * sy.I * η[0](s) ** 11 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 10 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 2 * sy.I * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 10
        * η[0](s) ** 11
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6 * sy.I * η[0](s) ** 10 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 24 * η[0](s) ** 10 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 4 * η[0](s) ** 10 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 4 * η[0](s) ** 10 * sy.Derivative(τ0(s), s) ** 2
        - 2 * η[0](s) ** 9 * η[1](s) * κ(s) * τ0(s) ** 2
        + 2 * η[0](s) ** 9 * η[2](s) * τ0(s) ** 2
        + 2 * sy.I * η[0](s) ** 9 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 4 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 2 * sy.I * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 6 * η[0](s) ** 8 * η[1](s) ** 2 * τ0(s) ** 2
        - 2 * sy.I * η[0](s) ** 8 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - η[0](s) ** 8 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * η[0](s) ** 8 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 26 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 2 * sy.I * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 2 * η[0](s) ** 8 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 8 * sy.Derivative(τ0(s), s) ** 2
        - 6 * η[0](s) ** 7 * η[1](s) * κ(s) * τ0(s) ** 2
        - 28 * sy.I * η[0](s) ** 7 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 2 * η[0](s) ** 7 * η[2](s) * τ0(s) ** 2
        + 4 * sy.I * η[0](s) ** 7 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 10 * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 4 * sy.I * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 10
        * η[0](s) ** 7
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 9 * η[0](s) ** 6 * η[1](s) ** 2 * τ0(s) ** 2
        + 2 * sy.I * η[0](s) ** 6 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 2 * η[0](s) ** 6 * κ(s) ** 2 * τ0(s) ** 2
        + 12 * sy.I * η[0](s) ** 6 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 4 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 2 * sy.I * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 2 * η[0](s) ** 6 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 2 * η[0](s) ** 6 * sy.Derivative(τ0(s), s) ** 2
        + 4 * η[0](s) ** 5 * η[1](s) * κ(s) * τ0(s) ** 2
        + 16 * sy.I * η[0](s) ** 5 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[0](s) ** 5 * η[2](s) * τ0(s) ** 2
        - 4 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 2 * η[0](s) ** 5 * τ0(s) * sy.Derivative(η[0](s), s) * sy.Derivative(τ0(s), s)
        + 6 * η[0](s) ** 4 * η[1](s) ** 2 * τ0(s) ** 2
        + 4 * sy.I * η[0](s) ** 4 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + η[0](s) ** 4 * κ(s) ** 2 * τ0(s) ** 2
        + 9 * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 4 * sy.I * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 2 * η[0](s) ** 4 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 2 * η[0](s) ** 4 * sy.Derivative(τ0(s), s) ** 2
        + 4 * η[0](s) ** 3 * η[1](s) * κ(s) * τ0(s) ** 2
        + 8 * sy.I * η[0](s) ** 3 * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[0](s) ** 3 * η[2](s) * τ0(s) ** 2
        - 2 * sy.I * η[0](s) ** 3 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 2 * η[0](s) ** 3 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 2 * sy.I * η[0](s) ** 3 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 2 * η[0](s) ** 3 * τ0(s) * sy.Derivative(η[0](s), s) * sy.Derivative(τ0(s), s)
        + 7 * η[0](s) ** 2 * η[1](s) ** 2 * τ0(s) ** 2
        - 2 * sy.I * η[0](s) ** 2 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 2 * η[0](s) ** 2 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * η[0](s) ** 2 * κ(s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        + 4 * η[0](s) ** 2 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 2 * sy.I * η[0](s) ** 2 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 4 * η[0](s) * η[1](s) * κ(s) * τ0(s) ** 2
        - 8 * sy.I * η[0](s) * η[1](s) * τ0(s) ** 2 * sy.Derivative(η[0](s), s)
        - 2 * η[1](s) ** 2 * τ0(s) ** 2
    )
    / (
        8
        * (η[0](s) - 1) ** 2
        * (η[0](s) + 1) ** 2
        * (η[0](s) ** 2 + 1) ** 2
        * η[0](s) ** 6
        * τ0(s) ** 3
    )
)

P_term[2] = (
    -σ
    * (
        -6 * Λ_[1] ** 2 * ς * σ * τb**4 * η[0](s) ** 14 * τ0(s) ** 3
        + 12 * Λ_[1] ** 2 * ς * σ * τb**4 * η[0](s) ** 10 * τ0(s) ** 3
        - 6 * Λ_[1] ** 2 * ς * σ * τb**4 * η[0](s) ** 6 * τ0(s) ** 3
        + 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 15 * τ0(s) ** 2
        + 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 13 * τ0(s) ** 2
        - 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 11 * τ0(s) ** 2
        - 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 9 * τ0(s) ** 2
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 16 * τ0(s)
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 12 * τ0(s) ** 5
        + 6 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 12 * τ0(s)
        + 6 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 8 * τ0(s) ** 5
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 8 * τ0(s)
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 4 * τ0(s) ** 5
        - 3 * Λ_[1] ** 2 * τb**5 * η[0](s) ** 15 * τ0(s) ** 4
        + 6 * Λ_[1] ** 2 * τb**5 * η[0](s) ** 11 * τ0(s) ** 4
        - 3 * Λ_[1] ** 2 * τb**5 * η[0](s) ** 7 * τ0(s) ** 4
        - 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 13 * η[1](s) * τ0(s) ** 5
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 13
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 12 * κ(s) * τ0(s) ** 5
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 12
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 11 * η[1](s) * τ0(s) ** 5
        + 12 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 9 * η[1](s) * τ0(s) ** 5
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 9
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 12 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 8 * κ(s) * τ0(s) ** 5
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 8
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 7 * η[1](s) * τ0(s) ** 5
        - 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 5 * η[1](s) * τ0(s) ** 5
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 5
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 4 * κ(s) * τ0(s) ** 5
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 4
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 3 * η[1](s) * τ0(s) ** 5
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 14
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 13 * κ(s) * τ0(s) ** 4
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 13
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 11 * κ(s) * τ0(s) ** 4
        - 36
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 11
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 10 * η[1](s) * τ0(s) ** 4
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 10
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 24 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 9 * κ(s) * τ0(s) ** 4
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 9
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 8 * η[1](s) * τ0(s) ** 4
        + 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 7 * κ(s) * τ0(s) ** 4
        + 48
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 7
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 18 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 6 * η[1](s) * τ0(s) ** 4
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 6
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 5 * κ(s) * τ0(s) ** 4
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 5
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 4 * η[1](s) * τ0(s) ** 4
        - 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 3 * κ(s) * τ0(s) ** 4
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 3
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 2 * η[1](s) * τ0(s) ** 4
        + 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 16 * κ(s) * τ0(s) ** 3
        - 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 14 * κ(s) * τ0(s) ** 3
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 14
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * ς * τb**4 * η[0](s) ** 12 * κ(s) * τ0(s) ** 3
        - 24
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 12
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 18 * Λ_[1] * ς * τb**4 * η[0](s) ** 11 * η[1](s) * τ0(s) ** 3
        + 12 * Λ_[1] * ς * τb**4 * η[0](s) ** 10 * κ(s) * τ0(s) ** 3
        + 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 9 * η[1](s) * τ0(s) ** 3
        + 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 8 * κ(s) * τ0(s) ** 3
        + 24
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 8
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 18 * Λ_[1] * ς * τb**4 * η[0](s) ** 7 * η[1](s) * τ0(s) ** 3
        - 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 6 * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 6
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 5 * η[1](s) * τ0(s) ** 3
        - 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 15 * η[1](s) * τ0(s) ** 3
        + 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 15
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 14 * κ(s) * τ0(s) ** 3
        + 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 14
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 13 * η[1](s) * τ0(s) ** 3
        + 12 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 11 * η[1](s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 11
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 12 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 10 * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 10
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 9 * η[1](s) * τ0(s) ** 3
        - 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 7 * η[1](s) * τ0(s) ** 3
        + 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 7
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 6 * κ(s) * τ0(s) ** 3
        + 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 6
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 5 * η[1](s) * τ0(s) ** 3
        - 12 * Λ_[1] * σ * τb**3 * η[0](s) ** 14 * η[1](s) * τ0(s) ** 2
        - 12
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 14
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 13 * κ(s) * τ0(s) ** 2
        - 24
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 13
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * σ * τb**3 * η[0](s) ** 12 * η[1](s) * τ0(s) ** 2
        + 18 * Λ_[1] * σ * τb**3 * η[0](s) ** 10 * η[1](s) * τ0(s) ** 2
        + 24
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 10
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        + 12 * Λ_[1] * σ * τb**3 * η[0](s) ** 9 * κ(s) * τ0(s) ** 2
        + 24
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 9
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 18 * Λ_[1] * σ * τb**3 * η[0](s) ** 8 * η[1](s) * τ0(s) ** 2
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 6 * η[1](s) * τ0(s) ** 2
        - 12
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 6
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 5 * κ(s) * τ0(s) ** 2
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 4 * η[1](s) * τ0(s) ** 2
        - 6 * Λ_[1] * τb**4 * η[0](s) ** 16 * κ(s) * τ0(s)
        + 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 15 * sy.Derivative(τ0(s), s)
        - 12
        * sy.I
        * Λ_[1]
        * τb**4
        * η[0](s) ** 14
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        + 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 13 * sy.Derivative(τ0(s), s)
        + 12 * Λ_[1] * τb**4 * η[0](s) ** 12 * κ(s) * τ0(s)
        + 24
        * sy.I
        * Λ_[1]
        * τb**4
        * η[0](s) ** 12
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        + 18 * Λ_[1] * τb**4 * η[0](s) ** 11 * η[1](s) * τ0(s)
        - 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 11 * sy.Derivative(τ0(s), s)
        + 36
        * sy.I
        * Λ_[1]
        * τb**4
        * η[0](s) ** 10
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        + 12 * Λ_[1] * τb**4 * η[0](s) ** 9 * η[1](s) * τ0(s)
        - 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 9 * sy.Derivative(τ0(s), s)
        - 6 * Λ_[1] * τb**4 * η[0](s) ** 8 * κ(s) * τ0(s)
        - 6 * Λ_[1] * τb**4 * η[0](s) ** 7 * η[1](s) * τ0(s)
        - 12 * Λ_[2] * ς * τb**3 * η[0](s) ** 13 * τ0(s) ** 4
        + 24 * Λ_[2] * ς * τb**3 * η[0](s) ** 9 * τ0(s) ** 4
        - 12 * Λ_[2] * ς * τb**3 * η[0](s) ** 5 * τ0(s) ** 4
        - 12 * Λ_[2] * τb**3 * η[0](s) ** 15 * τ0(s) ** 2
        + 24 * Λ_[2] * τb**3 * η[0](s) ** 11 * τ0(s) ** 2
        - 12 * Λ_[2] * τb**3 * η[0](s) ** 7 * τ0(s) ** 2
        - 3 * σ**3 * η[0](s) ** 14 * η[1](s) ** 2 * τ0(s) ** 5
        + 6
        * sy.I
        * σ**3
        * η[0](s) ** 14
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 3 * σ**3 * η[0](s) ** 14 * τ0(s) ** 3 * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ**3 * η[0](s) ** 13 * η[1](s) * κ(s) * τ0(s) ** 5
        + 6
        * sy.I
        * σ**3
        * η[0](s) ** 13
        * η[1](s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 13
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 6
        * σ**3
        * η[0](s) ** 13
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 6 * σ**3 * η[0](s) ** 12 * η[1](s) ** 2 * τ0(s) ** 5
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 12
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 3 * σ**3 * η[0](s) ** 12 * κ(s) ** 2 * τ0(s) ** 5
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 12
        * κ(s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 3 * σ**3 * η[0](s) ** 12 * τ0(s) ** 5 * sy.Derivative(η[0](s), s) ** 2
        - 6 * σ**3 * η[0](s) ** 11 * η[1](s) * κ(s) * τ0(s) ** 5
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 11
        * η[1](s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 3 * σ**3 * η[0](s) ** 10 * η[1](s) ** 2 * τ0(s) ** 5
        - 12
        * sy.I
        * σ**3
        * η[0](s) ** 10
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 6 * σ**3 * η[0](s) ** 10 * τ0(s) ** 3 * sy.Derivative(τ0(s), s) ** 2
        - 12 * σ**3 * η[0](s) ** 9 * η[1](s) * κ(s) * τ0(s) ** 5
        - 12
        * sy.I
        * σ**3
        * η[0](s) ** 9
        * η[1](s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 12
        * sy.I
        * σ**3
        * η[0](s) ** 9
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 12
        * σ**3
        * η[0](s) ** 9
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 12 * σ**3 * η[0](s) ** 8 * η[1](s) ** 2 * τ0(s) ** 5
        + 12
        * sy.I
        * σ**3
        * η[0](s) ** 8
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 6 * σ**3 * η[0](s) ** 8 * κ(s) ** 2 * τ0(s) ** 5
        + 12
        * sy.I
        * σ**3
        * η[0](s) ** 8
        * κ(s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 6 * σ**3 * η[0](s) ** 8 * τ0(s) ** 5 * sy.Derivative(η[0](s), s) ** 2
        + 12 * σ**3 * η[0](s) ** 7 * η[1](s) * κ(s) * τ0(s) ** 5
        + 12
        * sy.I
        * σ**3
        * η[0](s) ** 7
        * η[1](s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 3 * σ**3 * η[0](s) ** 6 * η[1](s) ** 2 * τ0(s) ** 5
        + 6
        * sy.I
        * σ**3
        * η[0](s) ** 6
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 3 * σ**3 * η[0](s) ** 6 * τ0(s) ** 3 * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ**3 * η[0](s) ** 5 * η[1](s) * κ(s) * τ0(s) ** 5
        + 6
        * sy.I
        * σ**3
        * η[0](s) ** 5
        * η[1](s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 6 * sy.I * σ**3 * η[0](s) ** 5 * κ(s) * τ0(s) ** 4 * sy.Derivative(τ0(s), s)
        + 6
        * σ**3
        * η[0](s) ** 5
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 6 * σ**3 * η[0](s) ** 4 * η[1](s) ** 2 * τ0(s) ** 5
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 4
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 3 * σ**3 * η[0](s) ** 4 * κ(s) ** 2 * τ0(s) ** 5
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 4
        * κ(s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 3 * σ**3 * η[0](s) ** 4 * τ0(s) ** 5 * sy.Derivative(η[0](s), s) ** 2
        - 6 * σ**3 * η[0](s) ** 3 * η[1](s) * κ(s) * τ0(s) ** 5
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 3
        * η[1](s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 3 * σ**3 * η[0](s) ** 2 * η[1](s) ** 2 * τ0(s) ** 5
        + 4 * σ**2 * τb * η[0](s) ** 15 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 4 * σ**2 * τb * η[0](s) ** 14 * η[2](s) * τ0(s) ** 4
        - 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 14
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 8
        * σ**2
        * τb
        * η[0](s) ** 14
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6 * σ**2 * τb * η[0](s) ** 13 * η[1](s) ** 2 * τ0(s) ** 4
        + 2
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 13
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 12 * σ**2 * τb * η[0](s) ** 13 * κ(s) ** 2 * τ0(s) ** 4
        - 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 13
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 13 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        + 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 13
        * τ0(s) ** 4
        * sy.Derivative(η[1](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 13 * τ0(s) ** 3 * sy.Derivative(τ0(s), (s, 2))
        - 4 * σ**2 * τb * η[0](s) ** 13 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 2 * σ**2 * τb * η[0](s) ** 12 * η[1](s) * κ(s) * τ0(s) ** 4
        - 26
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 12
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 12 * η[2](s) * τ0(s) ** 4
        + 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 12
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 4 * σ**2 * τb * η[0](s) ** 12 * τ0(s) ** 4 * sy.Derivative(η[0](s), (s, 2))
        - 4 * sy.I * σ**2 * τb * η[0](s) ** 12 * τ0(s) ** 4 * sy.Derivative(κ(s), s)
        - 28
        * σ**2
        * τb
        * η[0](s) ** 12
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 4 * σ**2 * τb * η[0](s) ** 11 * η[1](s) ** 2 * τ0(s) ** 4
        + 10
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 11
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 4 * σ**2 * τb * η[0](s) ** 11 * κ(s) ** 2 * τ0(s) ** 4
        + 36
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 11
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 32 * σ**2 * τb * η[0](s) ** 11 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        - 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 11
        * τ0(s) ** 4
        * sy.Derivative(η[1](s), s)
        - 8 * σ**2 * τb * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        + 14 * σ**2 * τb * η[0](s) ** 10 * η[1](s) * κ(s) * τ0(s) ** 4
        + 46
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 10
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 8 * σ**2 * τb * η[0](s) ** 10 * η[2](s) * τ0(s) ** 4
        + 32
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 10
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 16
        * σ**2
        * τb
        * η[0](s) ** 10
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 16 * σ**2 * τb * η[0](s) ** 9 * η[1](s) ** 2 * τ0(s) ** 4
        + 2
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 9
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 24 * σ**2 * τb * η[0](s) ** 9 * κ(s) ** 2 * τ0(s) ** 4
        + 32
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 9
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 8 * σ**2 * τb * η[0](s) ** 9 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        - 8 * sy.I * σ**2 * τb * η[0](s) ** 9 * τ0(s) ** 4 * sy.Derivative(η[1](s), s)
        - 8 * σ**2 * τb * η[0](s) ** 9 * τ0(s) ** 3 * sy.Derivative(τ0(s), (s, 2))
        + 8 * σ**2 * τb * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        + 10 * σ**2 * τb * η[0](s) ** 8 * η[1](s) * κ(s) * τ0(s) ** 4
        + 34
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 8
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 8 * σ**2 * τb * η[0](s) ** 8 * η[2](s) * τ0(s) ** 4
        - 8
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 8
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 8 * σ**2 * τb * η[0](s) ** 8 * τ0(s) ** 4 * sy.Derivative(η[0](s), (s, 2))
        + 8 * sy.I * σ**2 * τb * η[0](s) ** 8 * τ0(s) ** 4 * sy.Derivative(κ(s), s)
        + 32
        * σ**2
        * τb
        * η[0](s) ** 8
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 8 * σ**2 * τb * η[0](s) ** 7 * η[1](s) ** 2 * τ0(s) ** 4
        - 14
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 7
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 8 * σ**2 * τb * η[0](s) ** 7 * κ(s) ** 2 * τ0(s) ** 4
        - 48
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 7
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 40 * σ**2 * τb * η[0](s) ** 7 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        + 8 * sy.I * σ**2 * τb * η[0](s) ** 7 * τ0(s) ** 4 * sy.Derivative(η[1](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 22 * σ**2 * τb * η[0](s) ** 6 * η[1](s) * κ(s) * τ0(s) ** 4
        - 62
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 6
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 4 * σ**2 * τb * η[0](s) ** 6 * η[2](s) * τ0(s) ** 4
        - 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 6
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 8
        * σ**2
        * τb
        * η[0](s) ** 6
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 14 * σ**2 * τb * η[0](s) ** 5 * η[1](s) ** 2 * τ0(s) ** 4
        - 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 5
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 12 * σ**2 * τb * η[0](s) ** 5 * κ(s) ** 2 * τ0(s) ** 4
        - 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 5
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 5 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        + 4 * sy.I * σ**2 * τb * η[0](s) ** 5 * τ0(s) ** 4 * sy.Derivative(η[1](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 5 * τ0(s) ** 3 * sy.Derivative(τ0(s), (s, 2))
        - 4 * σ**2 * τb * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 8 * σ**2 * τb * η[0](s) ** 4 * η[1](s) * κ(s) * τ0(s) ** 4
        - 8
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 4
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 4 * σ**2 * τb * η[0](s) ** 4 * η[2](s) * τ0(s) ** 4
        + 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 4
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 4 * σ**2 * τb * η[0](s) ** 4 * τ0(s) ** 4 * sy.Derivative(η[0](s), (s, 2))
        - 4 * sy.I * σ**2 * τb * η[0](s) ** 4 * τ0(s) ** 4 * sy.Derivative(κ(s), s)
        - 4
        * σ**2
        * τb
        * η[0](s) ** 4
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 4 * σ**2 * τb * η[0](s) ** 3 * η[1](s) ** 2 * τ0(s) ** 4
        + 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 3
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 4 * σ**2 * τb * η[0](s) ** 3 * κ(s) ** 2 * τ0(s) ** 4
        + 12
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 3
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 8 * σ**2 * τb * η[0](s) ** 3 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        - 4 * sy.I * σ**2 * τb * η[0](s) ** 3 * τ0(s) ** 4 * sy.Derivative(η[1](s), s)
        + 8 * σ**2 * τb * η[0](s) ** 2 * η[1](s) * κ(s) * τ0(s) ** 4
        + 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 2
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 4 * σ**2 * τb * η[0](s) * η[1](s) ** 2 * τ0(s) ** 4
        + 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 15
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 6 * σ * τb**2 * η[0](s) ** 14 * κ(s) ** 2 * τ0(s) ** 3
        + 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 14
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 6 * σ * τb**2 * η[0](s) ** 14 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        - 6 * σ * τb**2 * η[0](s) ** 14 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ * τb**2 * η[0](s) ** 13 * η[1](s) * κ(s) * τ0(s) ** 3
        - 6 * σ * τb**2 * η[0](s) ** 13 * η[2](s) * τ0(s) ** 3
        + 6 * σ * τb**2 * η[0](s) ** 13 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        - 6 * sy.I * σ * τb**2 * η[0](s) ** 13 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 18
        * σ
        * τb**2
        * η[0](s) ** 13
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 3 * σ * τb**2 * η[0](s) ** 12 * η[1](s) ** 2 * τ0(s) ** 3
        + 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 12
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 48
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 12
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 24 * σ * τb**2 * η[0](s) ** 12 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        - 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 12
        * τ0(s) ** 3
        * sy.Derivative(η[1](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        + 6 * σ * τb**2 * η[0](s) ** 12 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 12 * σ * τb**2 * η[0](s) ** 11 * η[1](s) * κ(s) * τ0(s) ** 3
        + 24
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 11
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 11 * η[2](s) * τ0(s) ** 3
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 11
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 30 * σ * τb**2 * η[0](s) ** 11 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * σ * τb**2 * η[0](s) ** 11 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        + 30
        * σ
        * τb**2
        * η[0](s) ** 11
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 12 * σ * τb**2 * η[0](s) ** 10 * η[1](s) ** 2 * τ0(s) ** 3
        - 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 10
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 18 * σ * τb**2 * η[0](s) ** 10 * κ(s) ** 2 * τ0(s) ** 3
        - 54
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 10
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 132
        * σ
        * τb**2
        * η[0](s) ** 10
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s) ** 2
        + 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 10
        * τ0(s) ** 3
        * sy.Derivative(η[1](s), s)
        - 12 * σ * τb**2 * η[0](s) ** 10 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        + 12 * σ * τb**2 * η[0](s) ** 10 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        - 18 * σ * τb**2 * η[0](s) ** 9 * η[1](s) * κ(s) * τ0(s) ** 3
        - 90
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 9
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 12 * σ * τb**2 * η[0](s) ** 9 * η[2](s) * τ0(s) ** 3
        - 12 * σ * τb**2 * η[0](s) ** 9 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 12 * sy.I * σ * τb**2 * η[0](s) ** 9 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        + 12
        * σ
        * τb**2
        * η[0](s) ** 9
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 21 * σ * τb**2 * η[0](s) ** 8 * η[1](s) ** 2 * τ0(s) ** 3
        - 24
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 8
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 48
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 8
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 24 * σ * τb**2 * η[0](s) ** 8 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        + 30
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 8
        * τ0(s) ** 3
        * sy.Derivative(η[1](s), s)
        + 12 * σ * τb**2 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        - 12 * σ * τb**2 * η[0](s) ** 8 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        - 18 * σ * τb**2 * η[0](s) ** 7 * η[1](s) * κ(s) * τ0(s) ** 3
        - 102
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 7
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 12 * σ * τb**2 * η[0](s) ** 7 * η[2](s) * τ0(s) ** 3
        + 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 7
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 36 * σ * τb**2 * η[0](s) ** 7 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        - 12 * sy.I * σ * τb**2 * η[0](s) ** 7 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 36
        * σ
        * τb**2
        * η[0](s) ** 7
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 36 * σ * τb**2 * η[0](s) ** 6 * η[1](s) ** 2 * τ0(s) ** 3
        + 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 6
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 18 * σ * τb**2 * η[0](s) ** 6 * κ(s) ** 2 * τ0(s) ** 3
        + 66
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 6
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 6
        * τ0(s) ** 3
        * sy.Derivative(η[1](s), s)
        + 6 * σ * τb**2 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        - 6 * σ * τb**2 * η[0](s) ** 6 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 24 * σ * τb**2 * η[0](s) ** 5 * η[1](s) * κ(s) * τ0(s) ** 3
        + 66
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 5
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 5 * η[2](s) * τ0(s) ** 3
        + 6 * σ * τb**2 * η[0](s) ** 5 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        - 6 * sy.I * σ * τb**2 * η[0](s) ** 5 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        + 6
        * σ
        * τb**2
        * η[0](s) ** 5
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 18 * σ * τb**2 * η[0](s) ** 4 * η[1](s) ** 2 * τ0(s) ** 3
        + 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 4
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 4
        * τ0(s) ** 3
        * sy.Derivative(η[1](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        + 6 * σ * τb**2 * η[0](s) ** 4 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ * τb**2 * η[0](s) ** 3 * η[1](s) * κ(s) * τ0(s) ** 3
        + 30
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 3
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 3 * η[2](s) * τ0(s) ** 3
        - 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 3
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6 * σ * τb**2 * η[0](s) ** 3 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * σ * τb**2 * η[0](s) ** 3 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        + 6
        * σ
        * τb**2
        * η[0](s) ** 3
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 18 * σ * τb**2 * η[0](s) ** 2 * η[1](s) ** 2 * τ0(s) ** 3
        - 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 2
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6 * σ * τb**2 * η[0](s) ** 2 * κ(s) ** 2 * τ0(s) ** 3
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 2
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 12 * σ * τb**2 * η[0](s) ** 2 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        + 6 * sy.I * σ * τb**2 * η[0](s) ** 2 * τ0(s) ** 3 * sy.Derivative(η[1](s), s)
        - 12 * σ * τb**2 * η[0](s) * η[1](s) * κ(s) * τ0(s) ** 3
        - 24
        * sy.I
        * σ
        * τb**2
        * η[0](s)
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * σ * τb**2 * η[1](s) ** 2 * τ0(s) ** 3
        - 6 * τb**3 * η[0](s) ** 17 * κ(s) ** 2 * τ0(s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 16 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 6 * sy.I * τb**3 * η[0](s) ** 16 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 18
        * sy.I
        * τb**3
        * η[0](s) ** 15
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * τb**3 * η[0](s) ** 15 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 6 * τb**3 * η[0](s) ** 15 * sy.Derivative(τ0(s), s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 14 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 6 * τb**3 * η[0](s) ** 14 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * τb**3 * η[0](s) ** 14 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 6
        * τb**3
        * η[0](s) ** 14
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 6 * τb**3 * η[0](s) ** 13 * κ(s) ** 2 * τ0(s) ** 2
        - 18
        * sy.I
        * τb**3
        * η[0](s) ** 13
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[0](s) ** 12 * η[1](s) * κ(s) * τ0(s) ** 2
        + 6 * τb**3 * η[0](s) ** 12 * η[2](s) * τ0(s) ** 2
        - 12 * sy.I * τb**3 * η[0](s) ** 12 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 12 * τb**3 * η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 12 * sy.I * τb**3 * η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 12
        * τb**3
        * η[0](s) ** 12
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 15 * τb**3 * η[0](s) ** 11 * η[1](s) ** 2 * τ0(s) ** 2
        - 18
        * sy.I
        * τb**3
        * η[0](s) ** 11
        * η[1](s)
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        + 36
        * sy.I
        * τb**3
        * η[0](s) ** 11
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 48 * τb**3 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 18 * sy.I * τb**3 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 12 * τb**3 * η[0](s) ** 11 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 12 * τb**3 * η[0](s) ** 11 * sy.Derivative(τ0(s), s) ** 2
        - 6 * τb**3 * η[0](s) ** 10 * η[1](s) * κ(s) * τ0(s) ** 2
        - 84
        * sy.I
        * τb**3
        * η[0](s) ** 10
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[0](s) ** 10 * η[2](s) * τ0(s) ** 2
        + 12 * sy.I * τb**3 * η[0](s) ** 10 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 12 * sy.I * τb**3 * η[0](s) ** 10 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 24 * τb**3 * η[0](s) ** 9 * η[1](s) ** 2 * τ0(s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 9 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 6 * τb**3 * η[0](s) ** 9 * κ(s) ** 2 * τ0(s) ** 2
        + 36
        * sy.I
        * τb**3
        * η[0](s) ** 9
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 60 * τb**3 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 6 * τb**3 * η[0](s) ** 8 * η[1](s) * κ(s) * τ0(s) ** 2
        + 48
        * sy.I
        * τb**3
        * η[0](s) ** 8
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * τb**3 * η[0](s) ** 8 * η[2](s) * τ0(s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 8 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 12 * τb**3 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 6 * sy.I * τb**3 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 12
        * τb**3
        * η[0](s) ** 8
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 15 * τb**3 * η[0](s) ** 7 * η[1](s) ** 2 * τ0(s) ** 2
        + 18 * sy.I * τb**3 * η[0](s) ** 7 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 18
        * sy.I
        * τb**3
        * η[0](s) ** 7
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 48 * τb**3 * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 18 * sy.I * τb**3 * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 6 * τb**3 * η[0](s) ** 7 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 6 * τb**3 * η[0](s) ** 7 * sy.Derivative(τ0(s), s) ** 2
        + 6 * τb**3 * η[0](s) ** 6 * η[1](s) * κ(s) * τ0(s) ** 2
        + 12
        * sy.I
        * τb**3
        * η[0](s) ** 6
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * τb**3 * η[0](s) ** 6 * η[2](s) * τ0(s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 6 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 6 * τb**3 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * τb**3 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 6
        * τb**3
        * η[0](s) ** 6
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 18 * τb**3 * η[0](s) ** 5 * η[1](s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 5 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 6 * τb**3 * η[0](s) ** 5 * κ(s) ** 2 * τ0(s) ** 2
        - 18
        * sy.I
        * τb**3
        * η[0](s) ** 5
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 12 * τb**3 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 12 * τb**3 * η[0](s) ** 4 * η[1](s) * κ(s) * τ0(s) ** 2
        - 24
        * sy.I
        * τb**3
        * η[0](s) ** 4
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * τb**3 * η[0](s) ** 3 * η[1](s) ** 2 * τ0(s) ** 2
    )
    / (
        24
        * τb**2
        * (η[0](s) - 1) ** 2
        * (η[0](s) + 1) ** 2
        * (η[0](s) ** 2 + 1) ** 2
        * η[0](s) ** 6
        * τ0(s) ** 3
    )
)

Q_term[2] = (
    -σ
    * (
        6 * Λ_[1] ** 2 * ς * σ * τb**4 * η[0](s) ** 15 * τ0(s) ** 3
        - 12 * Λ_[1] ** 2 * ς * σ * τb**4 * η[0](s) ** 11 * τ0(s) ** 3
        + 6 * Λ_[1] ** 2 * ς * σ * τb**4 * η[0](s) ** 7 * τ0(s) ** 3
        - 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 12 * τ0(s) ** 2
        - 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 10 * τ0(s) ** 2
        + 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 8 * τ0(s) ** 2
        + 6 * Λ_[1] ** 2 * ς * τb**5 * η[0](s) ** 6 * τ0(s) ** 2
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 15 * τ0(s) ** 5
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 15 * τ0(s)
        + 6 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 11 * τ0(s) ** 5
        + 6 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 11 * τ0(s)
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 7 * τ0(s) ** 5
        - 3 * Λ_[1] ** 2 * σ * τb**4 * η[0](s) ** 7 * τ0(s)
        + 3 * Λ_[1] ** 2 * τb**5 * η[0](s) ** 12 * τ0(s) ** 4
        - 6 * Λ_[1] ** 2 * τb**5 * η[0](s) ** 8 * τ0(s) ** 4
        + 3 * Λ_[1] ** 2 * τb**5 * η[0](s) ** 4 * τ0(s) ** 4
        + 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 15 * κ(s) * τ0(s) ** 5
        - 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 14
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 13
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 11 * κ(s) * τ0(s) ** 5
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 10
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 9
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ**2 * τb**2 * η[0](s) ** 7 * κ(s) * τ0(s) ** 5
        - 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 6
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ**2
        * τb**2
        * η[0](s) ** 5
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 16 * κ(s) * τ0(s) ** 4
        - 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 14 * κ(s) * τ0(s) ** 4
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 14
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 13
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 12 * κ(s) * τ0(s) ** 4
        - 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 12
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 11 * η[1](s) * τ0(s) ** 4
        + 24 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 10 * κ(s) * τ0(s) ** 4
        - 48
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 10
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 9 * η[1](s) * τ0(s) ** 4
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 9
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 8 * κ(s) * τ0(s) ** 4
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 8
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 7 * η[1](s) * τ0(s) ** 4
        - 12 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 6 * κ(s) * τ0(s) ** 4
        + 36
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 6
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * σ * τb**3 * η[0](s) ** 5 * η[1](s) * τ0(s) ** 4
        + 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 5
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * Λ_[1]
        * ς
        * σ
        * τb**3
        * η[0](s) ** 4
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 13 * κ(s) * τ0(s) ** 3
        + 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 11 * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 11
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 12 * Λ_[1] * ς * τb**4 * η[0](s) ** 9 * κ(s) * τ0(s) ** 3
        + 24
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 9
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 18 * Λ_[1] * ς * τb**4 * η[0](s) ** 8 * η[1](s) * τ0(s) ** 3
        - 12 * Λ_[1] * ς * τb**4 * η[0](s) ** 7 * κ(s) * τ0(s) ** 3
        - 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 6 * η[1](s) * τ0(s) ** 3
        - 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 5 * κ(s) * τ0(s) ** 3
        - 24
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 5
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 18 * Λ_[1] * ς * τb**4 * η[0](s) ** 4 * η[1](s) * τ0(s) ** 3
        + 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 3 * κ(s) * τ0(s) ** 3
        + 12
        * sy.I
        * Λ_[1]
        * ς
        * τb**4
        * η[0](s) ** 3
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * ς * τb**4 * η[0](s) ** 2 * η[1](s) * τ0(s) ** 3
        - 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 15 * κ(s) * τ0(s) ** 3
        + 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 14
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 13
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 12 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 11 * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 10
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 12
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 9
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * σ**2 * τb**2 * η[0](s) ** 7 * κ(s) * τ0(s) ** 3
        + 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 6
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * Λ_[1]
        * σ**2
        * τb**2
        * η[0](s) ** 5
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 16 * κ(s) * τ0(s) ** 2
        + 12
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 15
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        - 12
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 14
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 12 * Λ_[1] * σ * τb**3 * η[0](s) ** 12 * κ(s) * τ0(s) ** 2
        + 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 11 * η[1](s) * τ0(s) ** 2
        - 24
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 11
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        + 48
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 10
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 9 * η[1](s) * τ0(s) ** 2
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 8 * κ(s) * τ0(s) ** 2
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 7 * η[1](s) * τ0(s) ** 2
        + 12
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 7
        * τ0(s)
        * sy.Derivative(τ0(s), s)
        - 36
        * sy.I
        * Λ_[1]
        * σ
        * τb**3
        * η[0](s) ** 6
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * Λ_[1] * σ * τb**3 * η[0](s) ** 5 * η[1](s) * τ0(s) ** 2
        + 6 * Λ_[1] * τb**4 * η[0](s) ** 13 * κ(s) * τ0(s)
        - 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 12 * sy.Derivative(τ0(s), s)
        + 12
        * sy.I
        * Λ_[1]
        * τb**4
        * η[0](s) ** 11
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        - 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 10 * sy.Derivative(τ0(s), s)
        - 12 * Λ_[1] * τb**4 * η[0](s) ** 9 * κ(s) * τ0(s)
        - 24 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 9 * τ0(s) * sy.Derivative(η[0](s), s)
        - 18 * Λ_[1] * τb**4 * η[0](s) ** 8 * η[1](s) * τ0(s)
        + 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 8 * sy.Derivative(τ0(s), s)
        - 36 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 7 * τ0(s) * sy.Derivative(η[0](s), s)
        - 12 * Λ_[1] * τb**4 * η[0](s) ** 6 * η[1](s) * τ0(s)
        + 12 * sy.I * Λ_[1] * τb**4 * η[0](s) ** 6 * sy.Derivative(τ0(s), s)
        + 6 * Λ_[1] * τb**4 * η[0](s) ** 5 * κ(s) * τ0(s)
        + 6 * Λ_[1] * τb**4 * η[0](s) ** 4 * η[1](s) * τ0(s)
        + 12 * Λ_[2] * ς * τb**3 * η[0](s) ** 14 * τ0(s) ** 4
        - 24 * Λ_[2] * ς * τb**3 * η[0](s) ** 10 * τ0(s) ** 4
        + 12 * Λ_[2] * ς * τb**3 * η[0](s) ** 6 * τ0(s) ** 4
        - 12 * Λ_[2] * τb**3 * η[0](s) ** 14 * τ0(s) ** 2
        + 24 * Λ_[2] * τb**3 * η[0](s) ** 10 * τ0(s) ** 2
        - 12 * Λ_[2] * τb**3 * η[0](s) ** 6 * τ0(s) ** 2
        - 3 * σ**3 * η[0](s) ** 15 * κ(s) ** 2 * τ0(s) ** 5
        + 6
        * sy.I
        * σ**3
        * η[0](s) ** 14
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 13
        * κ(s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 3 * σ**3 * η[0](s) ** 13 * τ0(s) ** 3 * sy.Derivative(τ0(s), s) ** 2
        - 6
        * σ**3
        * η[0](s) ** 12
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 6 * σ**3 * η[0](s) ** 11 * κ(s) ** 2 * τ0(s) ** 5
        + 3 * σ**3 * η[0](s) ** 11 * τ0(s) ** 5 * sy.Derivative(η[0](s), s) ** 2
        - 12
        * sy.I
        * σ**3
        * η[0](s) ** 10
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(τ0(s), s)
        + 12
        * sy.I
        * σ**3
        * η[0](s) ** 9
        * κ(s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        - 6 * σ**3 * η[0](s) ** 9 * τ0(s) ** 3 * sy.Derivative(τ0(s), s) ** 2
        + 12
        * σ**3
        * η[0](s) ** 8
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 3 * σ**3 * η[0](s) ** 7 * κ(s) ** 2 * τ0(s) ** 5
        - 6 * σ**3 * η[0](s) ** 7 * τ0(s) ** 5 * sy.Derivative(η[0](s), s) ** 2
        + 6 * sy.I * σ**3 * η[0](s) ** 6 * κ(s) * τ0(s) ** 4 * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * σ**3
        * η[0](s) ** 5
        * κ(s)
        * τ0(s) ** 5
        * sy.Derivative(η[0](s), s)
        + 3 * σ**3 * η[0](s) ** 5 * τ0(s) ** 3 * sy.Derivative(τ0(s), s) ** 2
        - 6
        * σ**3
        * η[0](s) ** 4
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 3 * σ**3 * η[0](s) ** 3 * τ0(s) ** 5 * sy.Derivative(η[0](s), s) ** 2
        - 4 * σ**2 * τb * η[0](s) ** 16 * κ(s) ** 2 * τ0(s) ** 4
        + 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 15
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 4 * sy.I * σ**2 * τb * η[0](s) ** 15 * τ0(s) ** 4 * sy.Derivative(κ(s), s)
        + 12 * σ**2 * τb * η[0](s) ** 14 * κ(s) ** 2 * τ0(s) ** 4
        - 12
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 14
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 4 * σ**2 * τb * η[0](s) ** 14 * τ0(s) ** 3 * sy.Derivative(τ0(s), (s, 2))
        + 4 * σ**2 * τb * η[0](s) ** 14 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 13
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 4 * σ**2 * τb * η[0](s) ** 13 * τ0(s) ** 4 * sy.Derivative(η[0](s), (s, 2))
        - 4
        * σ**2
        * τb
        * η[0](s) ** 13
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 8 * σ**2 * τb * η[0](s) ** 12 * κ(s) ** 2 * τ0(s) ** 4
        + 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 12
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 4 * σ**2 * τb * η[0](s) ** 12 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ**2 * τb * η[0](s) ** 11 * η[1](s) * κ(s) * τ0(s) ** 4
        - 8
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 11
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 8 * sy.I * σ**2 * τb * η[0](s) ** 11 * τ0(s) ** 4 * sy.Derivative(κ(s), s)
        + 8
        * σ**2
        * τb
        * η[0](s) ** 11
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 10
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 24 * σ**2 * τb * η[0](s) ** 10 * κ(s) ** 2 * τ0(s) ** 4
        + 48
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 10
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 4 * σ**2 * τb * η[0](s) ** 10 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        + 8 * σ**2 * τb * η[0](s) ** 10 * τ0(s) ** 3 * sy.Derivative(τ0(s), (s, 2))
        - 8 * σ**2 * τb * η[0](s) ** 10 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ**2 * τb * η[0](s) ** 9 * η[1](s) * κ(s) * τ0(s) ** 4
        + 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 9
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 32
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 9
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 8 * σ**2 * τb * η[0](s) ** 9 * τ0(s) ** 4 * sy.Derivative(η[0](s), (s, 2))
        + 32
        * σ**2
        * τb
        * η[0](s) ** 9
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 8
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 4 * σ**2 * τb * η[0](s) ** 8 * κ(s) ** 2 * τ0(s) ** 4
        - 32
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 8
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 24 * σ**2 * τb * η[0](s) ** 8 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        + 8 * σ**2 * τb * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 6 * σ**2 * τb * η[0](s) ** 7 * η[1](s) * κ(s) * τ0(s) ** 4
        + 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 7
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 4
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 7
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        - 4 * sy.I * σ**2 * τb * η[0](s) ** 7 * τ0(s) ** 4 * sy.Derivative(κ(s), s)
        - 16
        * σ**2
        * τb
        * η[0](s) ** 7
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 6
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 12 * σ**2 * τb * η[0](s) ** 6 * κ(s) ** 2 * τ0(s) ** 4
        - 36
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 6
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 8 * σ**2 * τb * η[0](s) ** 6 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        - 4 * σ**2 * τb * η[0](s) ** 6 * τ0(s) ** 3 * sy.Derivative(τ0(s), (s, 2))
        + 4 * σ**2 * τb * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 6 * σ**2 * τb * η[0](s) ** 5 * η[1](s) * κ(s) * τ0(s) ** 4
        - 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 5
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        - 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 5
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 4 * σ**2 * τb * η[0](s) ** 5 * τ0(s) ** 4 * sy.Derivative(η[0](s), (s, 2))
        - 28
        * σ**2
        * τb
        * η[0](s) ** 5
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 4
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(τ0(s), s)
        + 16
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 4
        * κ(s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 24 * σ**2 * τb * η[0](s) ** 4 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        - 4 * σ**2 * τb * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(τ0(s), s) ** 2
        - 6
        * sy.I
        * σ**2
        * τb
        * η[0](s) ** 3
        * η[1](s)
        * τ0(s) ** 4
        * sy.Derivative(η[0](s), s)
        + 8
        * σ**2
        * τb
        * η[0](s) ** 3
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 4 * σ**2 * τb * η[0](s) ** 2 * τ0(s) ** 4 * sy.Derivative(η[0](s), s) ** 2
        - 6 * σ * τb**2 * η[0](s) ** 17 * κ(s) ** 2 * τ0(s) ** 3
        + 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 16
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6 * sy.I * σ * τb**2 * η[0](s) ** 16 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 15
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 15 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        + 6 * σ * τb**2 * η[0](s) ** 15 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ * τb**2 * η[0](s) ** 14 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * σ * τb**2 * η[0](s) ** 14 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 6
        * σ
        * τb**2
        * η[0](s) ** 14
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 18 * σ * τb**2 * η[0](s) ** 13 * κ(s) ** 2 * τ0(s) ** 3
        + 6 * σ * τb**2 * η[0](s) ** 13 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        - 6 * σ * τb**2 * η[0](s) ** 13 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ * τb**2 * η[0](s) ** 12 * η[1](s) * κ(s) * τ0(s) ** 3
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 12
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6 * σ * τb**2 * η[0](s) ** 12 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 12 * sy.I * σ * τb**2 * η[0](s) ** 12 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 6
        * σ
        * τb**2
        * η[0](s) ** 12
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 11
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 66
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 11
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 12 * σ * τb**2 * η[0](s) ** 11 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        + 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 11
        * τ0(s) ** 3
        * sy.Derivative(η[1](s), s)
        + 12 * σ * τb**2 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        - 12 * σ * τb**2 * η[0](s) ** 11 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        - 6 * σ * τb**2 * η[0](s) ** 10 * η[1](s) * κ(s) * τ0(s) ** 3
        - 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 10
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 36 * σ * τb**2 * η[0](s) ** 10 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        - 12 * sy.I * σ * τb**2 * η[0](s) ** 10 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        + 36
        * σ
        * τb**2
        * η[0](s) ** 10
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 18 * σ * τb**2 * η[0](s) ** 9 * κ(s) ** 2 * τ0(s) ** 3
        - 48
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 9
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 72 * σ * τb**2 * η[0](s) ** 9 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        + 6 * sy.I * σ * τb**2 * η[0](s) ** 9 * τ0(s) ** 3 * sy.Derivative(η[1](s), s)
        - 12 * σ * τb**2 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        + 12 * σ * τb**2 * η[0](s) ** 9 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        - 18 * σ * τb**2 * η[0](s) ** 8 * η[1](s) * κ(s) * τ0(s) ** 3
        - 30
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 8
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 8
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 12 * σ * τb**2 * η[0](s) ** 8 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        - 6 * sy.I * σ * τb**2 * η[0](s) ** 8 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 12
        * σ
        * τb**2
        * η[0](s) ** 8
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 3 * σ * τb**2 * η[0](s) ** 7 * η[1](s) ** 2 * τ0(s) ** 3
        + 12
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 7
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 54
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 7
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6 * sy.I * σ * τb**2 * η[0](s) ** 7 * τ0(s) ** 3 * sy.Derivative(η[1](s), s)
        - 6 * σ * τb**2 * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        + 6 * σ * τb**2 * η[0](s) ** 7 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 6 * σ * τb**2 * η[0](s) ** 6 * η[1](s) * κ(s) * τ0(s) ** 3
        - 42
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 6
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 30 * σ * τb**2 * η[0](s) ** 6 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * σ * τb**2 * η[0](s) ** 6 * τ0(s) ** 3 * sy.Derivative(κ(s), s)
        - 30
        * σ
        * τb**2
        * η[0](s) ** 6
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6 * σ * τb**2 * η[0](s) ** 5 * η[1](s) ** 2 * τ0(s) ** 3
        + 6 * σ * τb**2 * η[0](s) ** 5 * κ(s) ** 2 * τ0(s) ** 3
        + 48
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 5
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 72 * σ * τb**2 * η[0](s) ** 5 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        - 6 * sy.I * σ * τb**2 * η[0](s) ** 5 * τ0(s) ** 3 * sy.Derivative(η[1](s), s)
        + 6 * σ * τb**2 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(τ0(s), (s, 2))
        - 6 * σ * τb**2 * η[0](s) ** 5 * τ0(s) * sy.Derivative(τ0(s), s) ** 2
        + 12 * σ * τb**2 * η[0](s) ** 4 * η[1](s) * κ(s) * τ0(s) ** 3
        - 18
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 4
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 4
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        - 6 * σ * τb**2 * η[0](s) ** 4 * τ0(s) ** 3 * sy.Derivative(η[0](s), (s, 2))
        + 18
        * σ
        * τb**2
        * η[0](s) ** 4
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 3 * σ * τb**2 * η[0](s) ** 3 * η[1](s) ** 2 * τ0(s) ** 3
        - 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 3
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(τ0(s), s)
        + 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 3
        * κ(s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        - 12 * σ * τb**2 * η[0](s) ** 3 * τ0(s) ** 3 * sy.Derivative(η[0](s), s) ** 2
        + 6
        * sy.I
        * σ
        * τb**2
        * η[0](s) ** 2
        * η[1](s)
        * τ0(s) ** 3
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[0](s) ** 14 * κ(s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 13 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 6 * sy.I * τb**3 * η[0](s) ** 13 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 18
        * sy.I
        * τb**3
        * η[0](s) ** 12
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[0](s) ** 12 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 6 * τb**3 * η[0](s) ** 12 * sy.Derivative(τ0(s), s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 11 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 6 * τb**3 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 6 * sy.I * τb**3 * η[0](s) ** 11 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 6
        * τb**3
        * η[0](s) ** 11
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 6 * τb**3 * η[0](s) ** 10 * κ(s) ** 2 * τ0(s) ** 2
        + 18
        * sy.I
        * τb**3
        * η[0](s) ** 10
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * τb**3 * η[0](s) ** 9 * η[1](s) * κ(s) * τ0(s) ** 2
        - 6 * τb**3 * η[0](s) ** 9 * η[2](s) * τ0(s) ** 2
        + 12 * sy.I * τb**3 * η[0](s) ** 9 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 12 * τb**3 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 12 * sy.I * τb**3 * η[0](s) ** 9 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 12
        * τb**3
        * η[0](s) ** 9
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        + 15 * τb**3 * η[0](s) ** 8 * η[1](s) ** 2 * τ0(s) ** 2
        + 18 * sy.I * τb**3 * η[0](s) ** 8 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 36
        * sy.I
        * τb**3
        * η[0](s) ** 8
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 48 * τb**3 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 18 * sy.I * τb**3 * η[0](s) ** 8 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 12 * τb**3 * η[0](s) ** 8 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        + 12 * τb**3 * η[0](s) ** 8 * sy.Derivative(τ0(s), s) ** 2
        + 6 * τb**3 * η[0](s) ** 7 * η[1](s) * κ(s) * τ0(s) ** 2
        + 84
        * sy.I
        * τb**3
        * η[0](s) ** 7
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 6 * τb**3 * η[0](s) ** 7 * η[2](s) * τ0(s) ** 2
        - 12 * sy.I * τb**3 * η[0](s) ** 7 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 12 * sy.I * τb**3 * η[0](s) ** 7 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 24 * τb**3 * η[0](s) ** 6 * η[1](s) ** 2 * τ0(s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 6 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 6 * τb**3 * η[0](s) ** 6 * κ(s) ** 2 * τ0(s) ** 2
        - 36
        * sy.I
        * τb**3
        * η[0](s) ** 6
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 60 * τb**3 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 6 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        - 6 * τb**3 * η[0](s) ** 5 * η[1](s) * κ(s) * τ0(s) ** 2
        - 48
        * sy.I
        * τb**3
        * η[0](s) ** 5
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[0](s) ** 5 * η[2](s) * τ0(s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 5 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        - 12 * τb**3 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        + 6 * sy.I * τb**3 * η[0](s) ** 5 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        + 12
        * τb**3
        * η[0](s) ** 5
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 15 * τb**3 * η[0](s) ** 4 * η[1](s) ** 2 * τ0(s) ** 2
        - 18 * sy.I * τb**3 * η[0](s) ** 4 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 18
        * sy.I
        * τb**3
        * η[0](s) ** 4
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 48 * τb**3 * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        + 18 * sy.I * τb**3 * η[0](s) ** 4 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 6 * τb**3 * η[0](s) ** 4 * τ0(s) * sy.Derivative(τ0(s), (s, 2))
        - 6 * τb**3 * η[0](s) ** 4 * sy.Derivative(τ0(s), s) ** 2
        - 6 * τb**3 * η[0](s) ** 3 * η[1](s) * κ(s) * τ0(s) ** 2
        - 12
        * sy.I
        * τb**3
        * η[0](s) ** 3
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[0](s) ** 3 * η[2](s) * τ0(s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 3 * κ(s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 6 * τb**3 * η[0](s) ** 3 * τ0(s) ** 2 * sy.Derivative(η[0](s), (s, 2))
        - 6 * sy.I * τb**3 * η[0](s) ** 3 * τ0(s) ** 2 * sy.Derivative(κ(s), s)
        - 6
        * τb**3
        * η[0](s) ** 3
        * τ0(s)
        * sy.Derivative(η[0](s), s)
        * sy.Derivative(τ0(s), s)
        - 18 * τb**3 * η[0](s) ** 2 * η[1](s) ** 2 * τ0(s) ** 2
        + 6 * sy.I * τb**3 * η[0](s) ** 2 * η[1](s) * τ0(s) * sy.Derivative(τ0(s), s)
        + 6 * τb**3 * η[0](s) ** 2 * κ(s) ** 2 * τ0(s) ** 2
        + 18
        * sy.I
        * τb**3
        * η[0](s) ** 2
        * κ(s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        - 12 * τb**3 * η[0](s) ** 2 * τ0(s) ** 2 * sy.Derivative(η[0](s), s) ** 2
        - 6 * sy.I * τb**3 * η[0](s) ** 2 * τ0(s) ** 2 * sy.Derivative(η[1](s), s)
        + 12 * τb**3 * η[0](s) * η[1](s) * κ(s) * τ0(s) ** 2
        + 24
        * sy.I
        * τb**3
        * η[0](s)
        * η[1](s)
        * τ0(s) ** 2
        * sy.Derivative(η[0](s), s)
        + 6 * τb**3 * η[1](s) ** 2 * τ0(s) ** 2
    )
    / (
        24
        * τb**2
        * (η[0](s) - 1) ** 2
        * (η[0](s) + 1) ** 2
        * (η[0](s) ** 2 + 1) ** 2
        * η[0](s) ** 5
        * τ0(s) ** 3
    )
)
